commands_list = """
 ↓ ‌‌‏الاوامر
 ————————————————
 ⏎ م1 ❬❭ اوامر الاداره‌‏
 ⏎ م2 ❬❭ اوامر اعدادات المجموعه‌‏
 ⏎ م3 ❬❭ اوامر الحماية‌‏
 ⏎ م4 ❬❭ اوامر الخدمه 
 ⏎ م5 ❬❭ اوامر الفله
 ⏎ م6 ❬❭ اوامر التعطيل و التفعل
 ⏎ م7 ❬❭ اوامر الوضع للمجموعه
 ⏎ م المطور ❬❭  اوامر المطور
 ⏎ اوامر الرد ❬❭ الاظافة‌‏ رد معين
 ⏎ الوسائط ❬❭ لمعرفه الاعدادات 
 ⏎ الاعدادات ❬❭ عدادات المجموعه
 ⏎ سورس ❬❭ سورس البوت
 ⏎ المطورين ❬❭ مطورين البوت
 ————————————————
 ‌‌‏⏎ تواصل معي للأستفسار ⬅️{ @yloxr } .
 """

M1 = """
 ⬅️❬اوامر الرفع والتنزيل❭
 ————————————————
 ⏎ رفع ❬❭ تنزيل ❬منشئ❭
 ⏎ رفع ❬❭ تنزيل ❬المدير❭
 ⏎ رفع ❬❭ تنزيل ❬ادمن❭ 
 ⏎ رفع ❬❭ تنزيل ❬مميز❭ 
 ————————————————
 ↓اوامر المسح
 ————————————————
 ⏎ مسح الادمنـيـه ❬❭ ❬لمسح الادمنيه❭
 ⏎ مسح المميزين ❬❭ ❬لمسح المميزين❭
 ⏎ مسح المدراء ❬❭ ❬لمسح المدراء❭
 ————————————————
 ↓اوامر الحظر والطرد والتقييد
 ————————————————
 ⏎ حظر ❬بالرد ❬❭ بالمعرف❭ لحظر العضو
 ⏎ الغاء الحظر ❬بالرد ❬❭ بالمعرف❭ لالغاء الحظر 
 ⏎ طرد ❬بالرد ❬❭ بالمعرف❭ لطرد العضو
 ⏎ كتم ❬بالرد ❬❭ بالمعرف❭ لكتم العضو 
 ⏎ الغاء الكتم ❬بالرد ❬❭ بالمعرف❭لالغاء الكتم 
 ⏎ تقييد ❬بالرد ❬❭ بالمعرف❭ لتقييد العضو
 ⏎ فك التقييد ❬بالرد ❬❭ بالمعرف❭ لالغاء تقييد العضو
 ⏎ منع + الكلمه ❬❭ لمنع كلمه داخل المجموعه
 ⏎ الغاء منع ❬❭ لالغاء منع الكلمه
 ————————————————
 ⏎  تواصل معي للأستفسار⬅️ @yloxr
 """

M2 = """
 ↓اوامر الاعدادات
 ————————————————
 ⏎ الرابط ❬❭ لعرض ❬الرابط❭  
 ⏎ انشاء رابط ❬❭ لستخراج ❬الرابط❭  
 ⏎ الادمنيه ❬❭ لعرض ❬الادمنيه❭
 ⏎ القوانين ❬❭ لعرض ❬القوانين❭ 
 ⏎ الوسائط ❬❭ لعرض اعدادات ❬الميديا❭ 
 ⏎ الحمايه ❬❭ لعرض كل ❬الاعدادات❭  
 ⏎ المدراء ❬❭ لعرض ❬الاداريين❭ 
 ⏎ المكتومين ❬❭ لعـرض ❬المكتومين❭ 
 ⏎ المحظورين ❬❭ لعرض ❬المحظورين❭
 ⏎ الاعدادات ❬❭ لعرض اعدادات❬المجموعه❭ 
 ⏎ المجموعه ❬❭ لعرض معلومات❬المجموعه❭
 ⏎ تغيير امر + الامر ❬❭ لتغيير❬اوامر البوت❭
 ⏎ مسح امر + الامر ❬❭ لمسح❬الامر المضاف❭
 ⏎ قائمه الاوامر ❬❭ لمعرفه❬الاوامرالمضافه❭
 ————————————————
 ⏎  تواصل معي للأستفسار⏎ @yloxr
 """

M3 = """
 ↓اوامر حمايه المجموعه
 ————————————————
 ⏎ قفل ❬❭ فتح ❬الكل❭
 ⏎ قفل ❬❭ فتح ❬التاك❭
 ⏎ قفل ❬❭ فتح ❬الفيديو❭
 ⏎ قفل ❬❭ فتح ❬الصور❭
 ⏎ قفل ❬❭ فتح ❬الملصقات❭
 ⏎ قفل ❬❭ فتح ❬المتحركه❭
 ⏎ قفل ❬❭ فتح ❬البصمات❭
 ⏎ قفل ❬❭ فتح ❬الدردشه❭
 ⏎ قفل ❬❭ فتح ❬الروابط❭
 ⏎ قفل ❬❭ فتح ❬البوتات❭
 ⏎ قفل ❬❭ فتح ❬التعديل❭
 ⏎ قفل ❬❭ فتح ❬المعرفات❭
 ⏎ قفل ❬❭ فتح ❬الكلايش❭
 ⏎ قفل ❬❭ فتح ❬التكرار❭
 ⏎ قفل ❬❭ فتح ❬الجهات❭
 ⏎ قفل ❬❭ فتح ❬الانلاين❭
 ⏎ قفل ❬❭ فتح ❬التوجيه❭
 ⏎ قفل ❬❭ فتح ❬الدخول بالرابط❭
 ⏎ قفل ❬❭ فتح ❬البوتات بالطرد❭
 ————————————————
 ↓القفل بالتقييد
 ————————————————
 ⏎ قفل ❬❭ فتح ❬الصـور بالتقييد❭
 ⏎ قفل ❬❭ فتح ❬الروابط بالتقييد❭
 ⏎ قفل ❬❭ فتح ❬المتحركه بالتقييـد❭
 ⏎ قفل ❬❭ فتح ❬الفيديو بالتقييد❭
 ⏎ قفل ❬❭ فتح ❬التوجيه بالتقييد❭ 
 ————————————————
 ⏎  تواصل معي للأستفسار ⬅️ @yloxr
 """

M4 = """
 ↓اوامر الخدمــه 
 ————————————————
 ⏎ ايدي ❬❭ لعرض صورتك -:- معلوماتك
 ⏎ ايديي ❬❭ لعرض ايديك 
 ⏎ ايدي بالرد ❬❭ لعرض ايدي الشخص
 ⏎ الرابط ❬❭ لستخراج رابط المجموعه
 ⏎ جهاتي ❬❭ لمعرفه عدد جهاتك
 ⏎ الالعاب ❬❭ لعرض العاب البوت
 ⏎ نقاطي ❬❭ لمعرفه عدد نقاطك
 ⏎ بيع نقاطي + العدد ❬❭ لبيع نقاطك
 ⏎ معلوماتي ❬❭ لعرض معلوماتك
 ⏎ السورس ❬❭ لعرض سورس البوت
 ⏎ الرتبه بالرد ❬❭ لمعرفه رتبه الشخص
 ⏎ التفاعل + بالمعرف ❬❭ لمعرفه تفاعل الشخص
 ⏎ التفاعل بالرد ❬❭ لمعرفه تفاعل الشخص
 ⏎ كشف بالمعرف ❬❭ لمعرفه معلومات حسابه
 ⏎ كشف بالرد ❬❭ لمعرفه معلومات حسابه
 ⏎ كشف البوتات ❬❭ لاظهار عدد البوتات الموجوده
 ⏎ طرد البوتات ❬❭ لطرد كل البوتات
 ⏎ طرد المحذوفين ❬❭ لطرد الحسابات المحذوفه
 ————————————————
 ⏎  تواصل معي للأستفسار ⬅️ @yloxr
 """

M5 = """
 ↓ اوامر الفله
 ⏎ مرحباً عزيزي
 ⏎ هذي اوامر الفله :
 ————————————————
 ⏎ رفع ❬❭ تنزيل ❬ فخر العرب ❭
 ⏎ رفع ❬❭ تنزيل ❬ حبيبتي ❭
 ⏎ رفع ❬❭ تنزيل ❬ غبي ❭
 ⏎ رفع ❬❭ تنزيل ❬ هطف ❭
 ⏎ رفع ❬❭ تنزيل ❬ كلب ❭
 ⏎ رفع ❬❭ تنزيل ❬ حمار ❭
 ⏎ رفع ❬❭ تنزيل ❬ تاج راس التيلي ❭
 ⏎ رفع ❬❭ تنزيل ❬ تاج راسي ❭
 ⏎ رفع ❬❭ ❬ بقلبي ❭ تنزيل ❬❭ ❬ من قلبي❭
 ⏎ ❬ طلاق ❭ ❬❭ ❬ زواج ❭
 ————————————————
 ⏎  تواصل معي للأستفسار ⬅️ @yloxr
 """

M6 = """
 ↓ اوامر التفعيل و التعطيل 
 ————————————————
 ⏎ تفعيل ❬❭ تعطيل  ❬ الرفــع ❭
 ⏎ تفعيل ❬❭ تعطيل  ❬ الردود ❭
 ⏎ تفعيل ❬❭ تعطيل  ❬الالعـاب❭
 ⏎ تفعيل ❬❭ تعطيل  ❬ التحذير ❭
 ⏎ تفعيل ❬❭ تعطيل  ❬ الترحيب ❭
 ⏎ تفعيل ❬❭ تعطيل  ❬ الايدي ❭
 ⏎ تفعيل ❬❭ تعطيل  ❬ الايدي بالصوره ❭
 ————————————————
 ⏎  تواصل معي للأستفسار ⬅️ @yloxr
 """

M7 = """
 ↓ اوامر اوامر الوضع للمجموعه
 ————————————————
 ⏎ ضع رابـط ❬❭ لوضع ❬ رابط ❭
 ⏎⏎ ضع اســـم ❬❭ لوضع ❬ اســم ❭
 ⏎ ضع صوره ❬❭ لوضع ❬ صوره ❭
 ⏎ ضع وصـف ❬❭ لوضع ❬ وصف ❭ 
 ⏎ ضع القوانيــن ❬❭ لوضع ❬ القوانين ❭ 
 ⏎ ضع الترحيب ❬❭ لوضع ❬ ترحيــب ❭
 ⏎ ضع تكرار + العدد ❬❭ لوضع ❬ تكرار ❭
 ————————————————
 ⏎  تواصل معي للأسفسار  ⏎ @CGGG1
 """

M_developer = "Hi @yloxr"

M_Reply = """
 ↓جميع اوامر الردود 
 ————————————————
 ⏎ الردود ❬❭ لعرض الردود المثبته
 ⏎ اضف رد ❬❭ لأضافه رد جديد
 ⏎ مسح رد ❬❭ الرد المراد مسحه
 ⏎ مسح الردود ❬❭ لمسح كل الردود
 ⏎ الردود العامه ❬❭ لمعرف الردود المثبته عام 
 ⏎ اضف رد عام ❬❭ لاضافه رد لكل المجموعات
 ⏎ مسح رد عام  ❬❭ لمسح الرد العام 
 ⏎ مسح الردود العامه ❬❭ لمسح كل ردود العامه
 ————————————————
 ⏎  تواصل معي للأستفسار ⬅️ @CGGG1
 """

M_Media = """
 •اعدادات الوسائط:

 •المتحركه «» ❬ مفتوح ❭
 •الدردشه «» ❬ مفتوح ❭
 •الانلاين «» ❬ مقفول ❭
 •الالعاب «» ❬ مقفول ❭
 •الصور «» ❬ مفتوح ❭
 •الفيديو «» ❬ مفتوح ❭
 •البصمات «» ❬ مفتوح ❭
 •الصوت «» ❬ مفتوح ❭
 •الملصقات «» ❬ مفتوح ❭
 •الجهات «» ❬ مقفول ❭
 •التوجيه «» ❬ مقفول ❭
 •الموقع «» ❬ مقفول ❭
 •الملفات «» ❬ مقفول ❭
 •الاشعارات «» ❬ مفتوح ❭
 •الكيبورد «» ❬ مقفول ❭
 """

M_Settings = """ 
 Hi sittings
 """

M_Developers="Hi developers"

M_Welcome = """
 """

user_data = lambda name, id_num, username, rank:f"""
♕♕♕♕♕♕♕♕♕♕\n
*Name*| `{name}`
*Username*| {username}
*User ID*| `{id_num}`
*Rank*| `{rank}`
♕♕♕♕♕♕♕♕♕♕
"""

poimes = ['''''', '''''', '', '']



# print(user_data('amjed', "78645", 'someone'))